

#include<stdio.h>
#include<stdlib.h>
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	return *p;//返回1小端 ，返回0为大端
//}
//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//int main()
//{
//	//返回1为小端 返回0为大端
//	
//	int ret=check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}

//输出为什么
//int main()
//{
//	char a = -1;
//	//10000000000000000000000000000001   原码
//	//11111111111111111111111111111110   反码
//	//11111111111111111111111111111111   补码
//	//11111111 char型截断
//	//11111111111111111111111111111111   强制类型转换 然后在变为原码为-1
//	signed char b = -1;
//	//11111111
//	unsigned char c = -1;
//	//11111111
//	//00000000000000000000000011111111  字符型打印时强制转换为整形 无符号补0
//	//255
//	printf("a=%d,b=%d,c=%d", a, b, c);//-1 -1 255
//	return 0;
//}
//输出为什么
//int main()
//{
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

//输出结果
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000  -原码
//	//11111111111111111111111111111111  -反码
//	//11111111111111111111111110000000  -补码
//	//10000000  char截断
//	//11111111111111111111111110000000  -整形提升补1
//	//%u当作无符号 故原码反码补码一样
//	printf("%u\n", a);
//	//%u-打印十进制无符号数字
//	return 0;
//}

//
//int main()
//{
//	int i = -20;         
//	// 10000000 00000000 00000000 00010100--原码
//	// 11111111 11111111 11111111 11101011--反码
//	// 11111111 11111111 11111111 11101100--补码
//
//	unsigned int j = 10; 
//	// 00000000 00000000 00000000 00001010--原码
//	// 补码相加
//	// 11111111 11111111 11111111 11110110--结果 补码
//	// 11111111 11111111 11111111 11110101--反码
//	// 10000000 00000000 00000000 00001010--原码 -10
//	printf("%d\n", i + j);
//	return 0;
//}
//#include <windows.h>
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);
//		Sleep(100);
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i = 0;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));
//	return 0;
//}
//

//unsigned char i = 0;
//
//int main()
//{
//	for (i = 0; i <= 25; i++)
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}



//9.0
//1001.0
//(-1)^0   *  1.001  *  2^3
//(-1)^s   *    M    *  2^E

int main()
{
	int n = 9;
	//0 00000000 00000000000000000001001--补码

	float* pFloat = (float*)&n;
	printf("n的值为:%d\n", n);
	printf("*pFloat的值为:%f\n", *pFloat);//0.000000
	//（-1）^0  *  0.00000000000000000001001 * 2^-126

	*pFloat = 9.0;
	//1001.0
	//1.001*2^3
	//(-1)^0 * 1.001 * 2^3
	//0 10000010 00100000000000000000

	printf("n的值为：%d\n", n);//认为上面的二进制是整数 
	printf("*pFloat的值为：%f\n", *pFloat);
	return 0;
}


//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1
//	//(-1)^0 * 1.011 *  2^2
//	//S=0
//	//M=1.011
//	//E=2 2+127=129
//	//0 10000001  01100000000000000000000
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40b00000
//	return 0;
//}
//
